/******************************************************************************
 *
 * 文件名  ： mcompat_log.h
 * 负责人  ： pengp
 * 创建日期： 20171002
 * 版本号  ： v1.0
 * 文件描述： 实现不同级别的打印
 * 版权说明： Copyright (c) 2000-2020
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _MCOMPAT_LOG_H_
#define _MCOMPAT_LOG_H_

/************************************ 头文件 ***********************************/
#include <stdio.h>
#include <stdlib.h>
#include <stdbool.h>

#include "mcompat_config.h"

/************************************ 宏定义 ***********************************/
#define MCOMPAT_LOG_DEBUG                (1)
#define MCOMPAT_LOG_INFO                 (2)
#define MCOMPAT_LOG_NOTICE               (3)
#define MCOMPAT_LOG_WARNING              (4)
#define MCOMPAT_LOG_ERR                  (5)
#define MCOMPAT_LOG_CRIT                 (6)
#define MCOMPAT_LOG_ALERT                (7)
#define MCOMPAT_LOG_EMERG                (8)

#define _MCOMPAT_LOG_BUF_SIZE            (256)

/*********************************** 类型定义 **********************************/


/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/
/* 调试级别:
 * 高于该值才输出log
 * 低于该值不输出log
 * */
extern int g_log_level;

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : mcompat_log_init
 * 函数功能: 初始化log模块
 * 输入参数: default_level - 调试级别(MCOMPAT_LOG_X)
 *           高于该值才输出log
 *           低于该值不输出log
 *           indent        - syslogd输出的前缀
 *
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void mcompat_log_init(int default_level, const char *indent);

/*******************************************************************************
 *
 * 函数名  : mcompat_log
 * 负责人  : 彭鹏
 * 创建日期：20171002
 * 函数功能: 输出信息(控制和log文件都有输出),带前缀
 *
 * 输入参数: prio - 打印级别(MCOMPAT_LOG_X)
 *           fmt  - 格式化字符串(与printf相同)
 *           ...  - 可变参数表
 *
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
#define mcompat_log(prio, fmt, ...) do { \
    if (prio >= g_log_level) { \
        char tmp[_MCOMPAT_LOG_BUF_SIZE]; \
        snprintf(tmp, sizeof(tmp), fmt, ##__VA_ARGS__); \
        _mcompat_log(prio, tmp, true); \
    } \
} while (0)

/*******************************************************************************
 *
 * 函数名  : mcompat_log_nt
 * 负责人  : 彭鹏
 * 创建日期：20171002
 * 函数功能: 输出信息(控制和log文件都有输出),不带前缀
 *
 * 输入参数: prio - 打印级别(MCOMPAT_LOG_X)
 *           fmt  - 格式化字符串(与printf相同)
 *           ...  - 可变参数表
 *
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
#define mcompat_log_nt(prio, fmt, ...) do { \
    if (prio >= g_log_level) { \
        char tmp[_MCOMPAT_LOG_BUF_SIZE]; \
        snprintf(tmp, sizeof(tmp), fmt, ##__VA_ARGS__); \
        _mcompat_log(prio, tmp, false); \
    } \
} while (0)

/*******************************************************************************
 *
 * 函数名  : mcompat_log_err
 * 负责人  : 彭鹏
 * 创建日期：20171002
 * 函数功能: 输出错误信息(控制和log文件都有输出),无条件输出
 *
 * 输入参数: fmt - 格式化字符串(与printf相同)
 *           ... - 可变参数表
 *
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
#define mcompat_log_err(fmt, ...) do { \
    char tmp[_MCOMPAT_LOG_BUF_SIZE]; \
    snprintf(tmp, sizeof(tmp), fmt, ##__VA_ARGS__); \
    _mcompat_log(MCOMPAT_LOG_ERR, tmp, true); \
    exit(0); \
} while (0)

/*******************************************************************************
 *
 * 函数名  : _mcompat_log
 * 负责人  : 彭鹏
 * 创建日期：20171002
 * 函数功能: 输出信息(控制和log文件都有输出)
 *
 * 输入参数: prio       - 打印级别(MCOMPAT_LOG_X)
 *           tmp        - 待输出的字符串
 *           has_prefix - 是否输出前缀信息
 *
 * 输出参数: 无
 * 返回值:   无
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
void _mcompat_log(int prio, char *tmp, bool has_prefix);

#endif // #ifndef _MCOMPAT_LOG_H_

