/******************************************************************************
 *
 * 文件名  : miner_api.c
 * 负责人  : pengp
 * 创建日期: 20171002
 * 版本号  : v1.0
 * 文件描述: 使用socket向cgminer获取信息
 * 版权说明: Copyright (c) 2000-2020 im
 * 其    他: 调用模板 ./cgminer_api "{\"command\":\"devs\"}" 10.0.50.41 4028
 * 修改日志: 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/

/************************************ 头文件 ***********************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "mcompat_lib.h"

/*----------------------------------- 声明区 ----------------------------------*/

/********************************** 变量声明区 *********************************/


/********************************** 函数声明区 *********************************/


/********************************** 变量实现区 *********************************/


/********************************** 函数实现区 *********************************/
/*******************************************************************************
 *
 * 函数名  : main
 * 负责人  : 彭鹏
 * 创建日期: 无
 * 函数功能: 主函数
 * 输入参数: argc - 参数个数
 *           argv - 命令行参数数组
 * 输出参数: 无
 * 返回值:   0   : 正常退出
 *           其它: 异常退出
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
int main(int argc, char *argv[])
{
    char *command = "summary";
    //char *host = "10.0.50.44";
    char *host = "127.0.0.1";
    short int port = 4028;
    char *ptr = NULL;
    int i = 1;
    int ret = 0;

    if(argc > 1)
    {
        if (strcmp(argv[1], "-?") == 0
        ||  strcmp(argv[1], "-h") == 0
        ||  strcmp(argv[1], "--help") == 0)
        {
            fprintf(stderr, "usage: %s [command [ip/host [port]]]\n", argv[0]);
            return 1;
        }
    }

    if(argc > i)
    {
        ptr = misc_trim(argv[i++]);
        if (strlen(ptr) > 0)
        {
            command = ptr;
        }
    }

    if(argc > i)
    {
        ptr = misc_trim(argv[i++]);
        if (strlen(ptr) > 0)
        {
            host = ptr;
        }
    }

    if(argc > i)
    {
        ptr = misc_trim(argv[i]);
        if (strlen(ptr) > 0)
        {
            port = atoi(ptr);
        }
    }

    ret = misc_call_api(command, host, port);
    return ret;
}

