/******************************************************************************
 *
 * 文件名  ： zynq_vid.h
 * 负责人  ： pengp
 * 创建日期： 20171212
 * 版本号  ： v1.0
 * 文件描述： zynq平台vid接口
 * 版权说明： Copyright (c) 2000-2020 im
 * 其    他： 无
 * 修改日志： 无
 *
 *******************************************************************************/
/*---------------------------------- 预处理区 ---------------------------------*/
#ifndef _ZYNQ_VID_H_
#define _ZYNQ_VID_H_

/************************************ 头文件 ***********************************/
#include <pthread.h>

/************************************ 宏定义 ***********************************/
#define SYSFS_VID_DEV       ("/dev/vidgen0.0")

#define IOCTL_SET_VAL_0     _IOR(MAGIC_NUM, 0, char *)
#define IOCTL_SET_VALUE_0   _IOR(MAGIC_NUM, 0, char *)
#define IOCTL_SET_CHAIN_0   _IOR(MAGIC_NUM, 1, char *)

/*********************************** 类型定义 **********************************/
/* zynq vid 结构体 */
typedef struct ZYNQ_VID_TAG{
    int             fd;     /* 文件句柄 */
    pthread_mutex_t lock;   /* 锁 */
}ZYNQ_VID_T;

/*--------------------------------- 接口声明区 --------------------------------*/

/*********************************** 全局变量 **********************************/

/*********************************** 接口函数 **********************************/
/*******************************************************************************
 *
 * 函数名  : zynq_gpio_g9_vid_set
 * 描述    : 设置g9版本vid级数
 * 输入参数: level - vid级数
 * 输出参数: 无
 * 返回值:   -1 失败
 *            0 成功
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern int zynq_gpio_g9_vid_set(int level);

/*******************************************************************************
 *
 * 函数名  : zynq_gpio_g19_vid_set
 * 描述    : 设置g19版本vid级数
 * 输入参数: chain_id - 链编号
 *           level    - vid级数
 * 输出参数: 无
 * 返回值:   -1 失败
 *            0 成功
 * 调用关系: 无
 * 其 它:    无
 *
 ******************************************************************************/
extern int zynq_gpio_g19_vid_set(int chain_id, int level);


#endif // #ifndef _ZYNQ_VID_H_

